import BtnCall from "./btns/BtnCall";
import ContactsCity from "./ContactsCity";
import Title from "./Title";
import googleMap from "./../assets/map.png"
const Contacts = () => {
    // const city = [
    //         {id: 0, city: "г. Москва, ул. Бутлерова 17", active: true},
    //         {id: 1, city: "г. Симферополь, ул. Комсомольская 1", active: false},
    //         {id: 2, city: "г. Краснодар, ул. Валерия Гассия 6", active: false},
    //         {id: 3, city: "г. Сочи, ул. Виноградная 20А", active: false},
    //         {id: 4, city: "г. Ростов на Дону, ул. Обороны 42Б", active: false},
    //         {id: 5, city: "г. Хабаровск, ул. Карла Маркса 96А", active: false},
    //         {id: 6, city: "г. Владивосток, ул. Некрасовская 36Б", active: false},
    //     ]
    return ( 
        
        <section className="contacts">
            <div className="container">
                <Title title="Контакты"/>
                <div className="contacts__wrapper">
                    <div className="contacts__left">
                        <div className="contacts__city">
                            <h4>Представительства:</h4>
                            <ContactsCity/>
                        </div>
                        <div className="contacts__action">
                            <h6 className="contacts__action-title">Связаться с нами:</h6>
                            <div className="contacts__action-links">
                                <BtnCall/>
                                <a href="#">
                                    <svg width="18" height="14" viewBox="0 0 18 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M0.798096 6.71989L4.70648 8.09575L6.23007 12.7236C6.29632 13.0363 6.69378 13.0988 6.95876 12.9112L9.14478 11.2227C9.34352 11.0351 9.67474 11.0351 9.93972 11.2227L13.8481 13.9118C14.1131 14.0995 14.5105 13.9744 14.5768 13.6617L17.4915 0.528547C17.5577 0.215853 17.2265 -0.0968385 16.8953 0.0282391L0.798096 5.90689C0.400635 6.03196 0.400635 6.59481 0.798096 6.71989ZM6.03135 7.40781L13.7156 2.96756C13.8481 2.90502 13.9806 3.09264 13.8481 3.15518L7.55494 8.72113C7.35621 8.90875 7.15748 9.1589 7.15748 9.4716L6.95876 10.9725C6.95876 11.1601 6.62753 11.2227 6.56129 10.9725L5.76636 8.22082C5.56763 7.90813 5.70013 7.53289 6.03135 7.40781Z" fill="#292C36" />
                                    </svg>
                                </a>
                                <a href="#">
                                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M13.6585 2.33333C12.1533 0.833333 10.1463 0 8.02787 0C3.62369 0 0.0557483 3.55556 0.0557483 7.94444C0.0557483 9.33333 0.445993 10.7222 1.11498 11.8889L0 16L4.23694 14.8889C5.40767 15.5 6.68989 15.8333 8.02787 15.8333C12.4321 15.8333 16 12.2778 16 7.88889C15.9443 5.83333 15.1638 3.83333 13.6585 2.33333ZM11.8746 10.7778C11.7073 11.2222 10.9268 11.6667 10.5366 11.7222C10.2021 11.7778 9.7561 11.7778 9.31011 11.6667C9.03136 11.5556 8.64112 11.4444 8.19512 11.2222C6.18815 10.3889 4.90592 8.38889 4.79443 8.22222C4.68293 8.11111 3.95819 7.16667 3.95819 6.16667C3.95819 5.16667 4.45993 4.72222 4.62718 4.5C4.79443 4.27778 5.01742 4.27778 5.18467 4.27778C5.29617 4.27778 5.46341 4.27778 5.57491 4.27778C5.68641 4.27778 5.85366 4.22222 6.02091 4.61111C6.18815 5 6.5784 6 6.63415 6.05556C6.68989 6.16667 6.68989 6.27778 6.63415 6.38889C6.5784 6.5 6.52265 6.61111 6.41115 6.72222C6.29965 6.83333 6.18815 7 6.1324 7.05556C6.0209 7.16667 5.90941 7.27778 6.02091 7.44444C6.1324 7.66667 6.52265 8.27778 7.13589 8.83333C7.91638 9.5 8.52962 9.72222 8.75261 9.83333C8.97561 9.94445 9.08711 9.88889 9.1986 9.77778C9.3101 9.66667 9.70035 9.22222 9.81185 9C9.92335 8.77778 10.0906 8.83333 10.2578 8.88889C10.4251 8.94444 11.4286 9.44445 11.5958 9.55556C11.8188 9.66667 11.9303 9.72222 11.9861 9.77778C12.0418 9.94444 12.0418 10.3333 11.8746 10.7778Z" fill="#292C36" />
                                    </svg>
                                </a>
                            </div>
                            <button className="contacts__action-btn">
                                Бесплатная консультация
                            </button>
                        </div>
                    </div>
                    <div className="contacts__right">
                        <img src={googleMap} alt="map" />
                    </div>
                </div>
            </div>
        </section>
     );
}
 
export default Contacts;