const footerData = [
        {title: "Представительства:", items: [
            "г. Москва, ул. Бутлерова 17",
            "г. Симферополь, ул. Комсомольская 1",
            "г. Краснодар, ул. Валерия Гассия 6",
            "г. Сочи, ул. Виноградная 20А",
            "г. Ростов на Дону, ул. Обороны 425",
            "г. Хабаровск, ул. Карла Маркса 96А",
            "г. Владивосток, ул. Некрасовская 36Б"
            ],
        },
        {
            title: "Уличная мебель",
            items: ["Скамейки", "Урны", "Вазоны", "Перголы", "Парклеты", "Садовая мебель", "Мебель для ТЦ", "МАФ"]
        },
        {
            title: "Умный город",
            items: ["Умная городская мебель", "Лавки", "Беседки", "Остановочные комплексы", "Дополнительные модули"]
        },
        {
            type: "double",
            items: [
                {
                    subtitle: "Благоустройство",
                    text: "Благоустройство парковых и зелёных зон"
                },
                {
                    subtitle: "Строительство объектов",
                    text: "Строительство и возведение малых архитектурных формиз декоративного бетона."
                }
            ]
        },
        // {
        //     title: "Благоустройство",
        //     items: ["Благоустройство парковых и зелёных зон"]
        // },
        // {
        //     title: "Строительство объектов",
        //     items: ["Строительство и возведение малых архитектурных формиз декоративного бетона."]
        // }
    ]
export default footerData